# Homebrew Bundle file for Craig's dotfiles environment
# Run with: brew bundle

# Core tools
brew "bash"                       # Modern bash (macOS ships ancient 3.2)
brew "coreutils"                  # GNU utilities (timeout, realpath, etc.)
brew "git"
brew "gh"                         # GitHub CLI
brew "gnupg"
brew "openssl"
brew "zsh"
brew "jq"                         # JSON processor

# Shell plugins
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Navigation
brew "zoxide"                     # Smarter cd — jump to frecent dirs by name
brew "eza"                        # Modern ls with colours and git status
brew "fzf"                        # Fuzzy finder for interactive selection

# Dev tools
brew "pre-commit"                 # Git hooks framework
brew "just"                       # Task runner
brew "shellcheck"                 # Shell script linter
brew "ccusage"                    # Claude Code usage tracker

# Python
brew "python"
brew "uv"                         # Fast Python package installer
brew "poetry"                     # Python dependency management
brew "ruff"                       # Fast Python linter/formatter

# JavaScript / TypeScript
brew "node"
brew "yarn"
brew "biome"                      # JS/TS formatter and linter

# Database
brew "postgresql"

# Libraries
brew "poppler"                    # PDF rendering

# Casks (desktop apps)
cask "docker-desktop"
cask "ghostty"                    # Terminal emulator
